print("Введите радиус круга в см")
PI=3.14
r=float(input())
c=2*PI*r # нашел длину в см
c1=c/100 # нашел длину в м
s=PI*(r)**2 # нашел площадь в см**2
s1=s/10000 # нашел площадь в м**2
print("Длина в см =",c, ".Длина в м =",c1, ".Площадь в см**2 =",s, ".Площадь в м**2 =",s1)
g=r*2**0.5 # нашел длину вписанного квадрата в см
h=g/100 # нашел длину вписанного квадрата в м
f=r*(3)**0.5 # нашел длину вписанного треугольника в см
k=f/100 # нашел длину вписанного треугольника в м
print("Длина стороны вписанного квадрата в см =",g, ".Длина стороны вписанного квадрата в м =",h, ".Длина стороны вписанного треугольника см =",f, ".Длина стороны вписанного треугольника в м =",k)
q=2*r # нашел длину описанного квадрата в см
w=q/100 # нашел длину описанного квадрата в м
e=2*r*(3)**0.5 # нашел длину описанного треугольника в см
l=e/100 # нашел длину описанного треугольника в м
t=2*r*((2**0.5)-1) # нашел длину описанного восьмиугольника в см
y=2*r*((2**0.5)-1)/100 # нашел длину описанного восьмиугольника в м
print("Длина стороны  описанного квадрата в см =",q, ".Длина стороны описанного квадрата в м =",w, ".Длина стороны описанного треугольника см =",e, ".Длина стороны описанного треугольника в м =",l, ".Длина стороны описанного восьмиугольника в см =",t, ".Длина стороны описанного восьмиугольника в м =",y )